// Напишите программу, которая принимает от пользователя случайное число и удаляет вторую цифру этого числа.

System.Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());


